# BuiltInFailures.PipingFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PipingFailures Class
BuiltInFailures Class Members See Also
---
Failures about Pipes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class PipingFailures
```

Visual Basic
---
```text
Public NotInheritable Class PipingFailures
```

Visual C++
---
```text
public ref class PipingFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..PipingFailures
# See Also
BuiltInFailures..::..PipingFailures Members
Autodesk.Revit.DB Namespace